src/cf/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ФИО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	ДатаОткрытия = ТекущаяДата();
	ЗапросФИО = Новый Запрос();
	ЗапросФИО.УстановитьПараметр("КонецПериода", ДатаОткрытия);
	ЗапросФИО.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	ЗапросФИО.Текст = "ВЫБРАТЬ
	          |	ФИОСрезПоследних.Фамилия КАК Фамилия,
	          |	ФИОСрезПоследних.Имя КАК Имя,
	          |	ФИОСрезПоследних.Отчество КАК Отчество
	          |ИЗ
	          |	РегистрСведений.ФИО.СрезПоследних(&КонецПериода) КАК ФИОСрезПоследних
	          |ГДЕ
	          |	ФИОСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	ВыборкаФИО = ЗапросФИО.Выполнить().Выбрать();
	ВыборкаФИО.Следующий();
    Фамилия = ВыборкаФИО.Фамилия;
	Имя = ВыборкаФИО.Имя;
	Отчество = ВыборкаФИО.Отчество;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 	
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗапросФИО = Новый Запрос();
	ЗапросФИО.УстановитьПараметр("КонецПериода", ДатаОткрытия);
	ЗапросФИО.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	ЗапросФИО.Текст = "ВЫБРАТЬ
	          |	ФИОСрезПоследних.Фамилия КАК Фамилия,
	          |	ФИОСрезПоследних.Имя КАК Имя,
	          |	ФИОСрезПоследних.Отчество КАК Отчество
	          |ИЗ
	          |	РегистрСведений.ФИО.СрезПоследних(&КонецПериода) КАК ФИОСрезПоследних
	          |ГДЕ
	          |	ФИОСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	ВыборкаФИО = ЗапросФИО.Выполнить().Выбрать();
	ВыборкаФИО.Следующий();
	Если ВыборкаФИО.Фамилия <> Фамилия Или 
		ВыборкаФИО.Имя <> Имя Или 
		ВыборкаФИО.Отчество <> Отчество Тогда 
		МенеджерЗаписи = РегистрыСведений.ФИО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ФизическоеЛицо = ТекущийОбъект.Ссылка;
		МенеджерЗаписи.Период = ДатаОткрытия;
		МенеджерЗаписи.Фамилия = Фамилия;
		МенеджерЗаписи.Имя = Имя;
		МенеджерЗаписи.Отчество = Отчество;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры
